<?php

//---------------------------функция добавления массива городов в базу данных OPEN-----------------------------------------//
//---------использовал, чтобы не вбивать данные вручную
function add_table($db, $cities) {                                                  
    foreach ($cities as $key => $value) {
        $db->query('INSERT INTO `cities` (id,city) VALUES (' . $key . ",'" . $value . "')") or die('Запрос не удался:');  //добавляем внутрь cities 
                                                                                                                        //со значениями id & city 
                                                                                                                        //значения key&value
    }
}
//---------------------------функция добавления массива городов в базу данных CLOSE-----------------------------------------//



//-------------------------------------функция добавления массива категорий в базу данных OPEN-----------------------------------//
//-------использовал,чтобы не вбивать данные вручную
function add_table1($db, $category) {                                                    
    $count = 0;                                                                  //добавляем id
    foreach ($category as $key => $value) {
        $count++;                                                                //с каждым проходом id увеличивается
        $db->query('REPLACE INTO `category` (id, category) VALUES (' . $count . ",'" . $key . "')"); //заменяем внутри category 
                                                                                                     //со значениями id & category 
                                                                                                     //значения count&key
        foreach ($value as $key1 => $value1) {
            $db->query('REPLACE INTO `category` (id, category, parent_id) VALUES (' . $key1 . ",'" . $value1 . "'," . $count . ")");
        }
    }
}
//-------------------------------------функция добавления массива категорий в базу данных CLOSE-----------------------------------//




